app/Http/Controllers/Web/CommonController.php

    public function autocompleteSearch(Request $request)
    {
        $out = array();
        $output = new ConsoleOutput();
        $filterResult = User::select('email')->where('email', 'LIKE', "%{$request->term}%")->get();
---
select `email` from `au_users` where `email` LIKE '%%'