app/Http/Controllers/Web/EditTrealetController.php

    public function update( Request $req, $id)
    {
        $output = new ConsoleOutput();

        $trealet= Trealets::find($id);
        $trealet-> title= $req->input('title');
        $trealet-> state= $req->input('state');
        $output->writeln($trealet-> published);
        $trealet-> published= $req->input('published');
        $trealet-> pass= $req->input('key');
        $trealet->save();
---
update `au_trealets` set `published` = '2', `state` = '0', `pass` = '123', `au_trealets`.`updated_at` = '2021-10-30 07:26:17' where `id` = 1