app/Http/Controllers/Web/InviteCreatorController.php

    public function invite($trealet_id)
    {
        $output = new ConsoleOutput();
        $members = array();
        $gr = Invite::select('email', 'status')->where('trealet_id', $trealet_id)->get();
        foreach ($gr as $value) {
            $member = User::select()
                ->where('email', $value['email'])
                ->first();
---
select `email`, `status` from `au_invites` where `trealet_id` = '1'
select * from `au_users` where `email` = 'ducthang.nguyen205@gmail.com' limit 1

    public function process(Request $request, $trealet_id)
    {
        $output = new ConsoleOutput();

        $iv = Invite::select()
            ->where('email',$request->get('email'))
            ->first();
        if($iv){
            return redirect()->back()->withSuccess('Người dùng đã có trong danh sách creator !' ) ;
        }
        do {
            //generate a random string using Laravel's str_random helper
            $token = Str::random(15);
        } //check if the token already exists and if it does, try again
        while (Invite::where('token', $token)->first());
---
select * from `au_invites` where `email` = 'ducthang.nguyen205@gmail.com' limit 1
select * from `au_invites` where `token` = 'JhFfIvLWwx1tYyv' limit 1

    public function accept($token)
    {
        $output = new ConsoleOutput();
        $output->writeln($token);
        $invite = Invite::select()->where('token', $token)->first();
        $output->writeln($invite);
        $invite-> status = "Active";
        $invite ->save();
        $user = User::select()
            ->where('email', $invite->email)
            ->first();
        $tr = Trealets::select()
            ->where('id', $invite->trealet_id)
            ->first();
---
select * from `au_invites` where `token` = 'JhFfIvLWwx1tYyv' limit 1
update `au_invites` set `status` = 'Active', `au_invites`.`updated_at` = '2021-10-30 07:16:33' where `id` = 8
select * from `au_users` where `email` = 'ducthang.nguyen205@gmail.com' limit 1
select * from `au_trealets` where `id` = 1 limit 1