app/Http/Controllers/Web/MyTrealets.php

    public function index()
    {


        $trs = Trealets::select()
            ->where('user_id', auth()->id())
            ->get();
---
select * from `au_trealets` where `user_id` = 46

    public function duplicate_trealet($id) {
        $sign = " (copy)";
        $trealet = Trealets::find($id);
        $new_trealet = $trealet ->replicate();
        $new_trealet ->title = $new_trealet ->title .$sign;
        $new_trealet ->save();
---
insert into `au_trealets` (`id_str`, `user_id`, `title`, `type`, `published`, `json`, `state`, `open_at`, `close_at`, `pass`, `updated_at`, `created_at`) values ('99450274157953025', 46, 'Tìm hiểu nhạc cụ dân tộc Đàn đá Tây Nguyên (copy)', 'streamline', 2, '{\r\n	\"trealet\":{\r\n		\"exec\":\"streamline\",\r\n		\"title\":\"Tìm hiểu nhạc cụ dân tộc Đàn đá Tây Nguyên\",\r\n		\"author\":\"Bảo tàng Văn hóa các Dân tộc Việt Nam\",\r\n		\"desc\":\"Đàn đá là một nhạc cụ cổ xưa nhất ở vùng đất Tây Nguyên, có vị trí quan trọng trong đời sống tinh thần và là “sợi dây” kết nối giữa con người với thế giới tâm linh, giữa hiện tại với quá khứ. Ngày nay, đàn đá vẫn sống động trong tâm thức và đời sống văn hóa tinh thần của đồng bào các dân tộc Tây Nguyên.\",\r\n		\"items\":[3498,\r\n			 {\"input\":{\"type\":\"picture\",\"label\":\"Hãy tìm một bức ảnh của đàn đá, chụp và upload lên hệ thống\"}}, \r\n			 3490,\r\n			 {\"input\":{\"type\":\"audio\",\"label\":\"Hãy bật bản nhạc được chơi bằng Đàn đá, thu âm và upload lên hệ thống\"}}, \r\n			 3506,\r\n			 {\"input\":{\"type\":\"qr\",\"label\":\"Hãy tìm đến hiện vật đàn đá và quét mã QR từ đó\"}},\r\n			 {\"input\":{\"type\":\"form\",\"label\":\"Hãy để lại lời nhận xét\"}}\r\n		]\r\n	}\r\n}', 0, '2021-10-07 10:35:16', '2021-10-07 10:35:16', '123', '2021-10-30 08:11:50', '2021-10-30 08:11:50')