app/Http/Controllers/Web/TrealetPlaysController.php

    public function index()
    {
		$utts = UserToTrealet::join('trealets','user_to_trealet.trealet_id_str','trealets.id_str')
							->select('trealets.id_str','trealets.title','user_to_trealet.user_id')
							->where('user_to_trealet.user_id','=',auth()->id())
							->groupBy('trealets.id_str','trealets.title','user_to_trealet.user_id')
							->get();
---
select `au_trealets`.`id_str`, `au_trealets`.`title`, `au_user_to_trealet`.`user_id` from `au_user_to_trealet` inner join `au_trealets` on `au_user_to_trealet`.`trealet_id_str` = `au_trealets`.`id_str` where `au_user_to_trealet`.`user_id` = 46 group by `au_trealets`.`id_str`, `au_trealets`.`title`, `au_user_to_trealet`.`user_id`