app/Http/Controllers/Web/TrealetsSearch.php

select * from `au_users` where `id` = 1 limit 1
select * from `au_users` where `id` = 56 limit 1
---
    public function index()
    {
        //At this momment query all Trealets for mock searching where published is 1
        $trs = Trealets::all()->where('active',"!=", 1);
        foreach ($trs as $tr) {
            $user = User::where('id',$tr->user_id)->first();
            $tr->creator = $user->username;
        };
        $user = NULL;

        //Get current user info (if authenticated)
        if(auth()->id()){
            $user = User::where('id','=',auth()->id())->first();